Emacs.org
#+TITLE: Jake's Emacs Config
#+AUTHOR: Jacob Stannix
#+PROPERTY: header-args :tangle config/.config/emacs/init.el :dir ~/.config/emacs
The following is my emacs config, =feel= free to take as much or as little as you like.
For a very comprehensive configuratoin guide please check out the [[https://www.youtube.com/watch?v=74zOY-vgkyw&list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ][Emacs From Scratch playlist]] on the [[https://www.youtube.com/c/SystemCrafters][System Crafters Youtube Channel]] or check out the [[https://github.com/daviwil/emacs-from-scratch][github]] repo. 
* Inbox
** General
*** Eshell
Paruse Documentation for useful configuration stuff
** Magit
*** TODO Forge
- [ ] Create token for github auth
- [ ] install and configure forge
  NOTE: Make sure to configure a GitHub token before using this package!
- https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
- https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started

  #+begin_src emacs-lisp :tangle no
    (use-package forge)
  #+end_src

** Development
*** TODO LSP Mode
[[https://github.com/emacs-lsp/lsp-mode][github]]
*** TODO Rustic Mode
[[https://github.com/brotzeit/rustic][github]]
** Org
*** DONE Habit Tracker
    CLOSED: [2021-08-29 Sun 20:28]
Habit tracking for underwear and teath brushing 
*** MAYBE [[https://github.com/org-roam/org-roam-ui][org-roam-ui]]
Description: Graphical front end for org roam 
*** TODO Update Org Capture Templates
Description: Create capture templates for =Shells.org=.
*** TODO Agenda view for dotfiles folder
* Preamble

#+begin_src emacs-lisp
  ;; NOTE: init.el is now generated from Emacs.org.  Please edit that file
  ;;       in Emacs and init.el will be generated automatically!
#+end_src

* Early Init

#+NAME: early-init-header
#+begin_src emacs-lisp :tangle no
  (my/--generate-file-header "Emacs.org" "early-init.el")
#+end_src

#+begin_src emacs-lisp :tangle config/.config/emacs/early-init.el :noweb yes
  <<early-init-header()>>
  (setq package-enable-at-startup nil)
  (defun my/--generate-file-header (parent-file tangle-file &optional delim) "generates a heading to say which file a file is generated form.
    by default it will us emacs-lisp comment symbols `;;' but this can be changed by specifing a third paramiter"
         (if delim
             (concat delim " NOTE: " tangle-file " is generated from " parent-file ". Please edit that file
  " delim "        in emacs and " tangle-file " will be generated automatially!")
           (concat ";; NOTE: " tangle-file " is generated from " parent-file ". Please edit that file
    ;;        in emacs and " tangle-file " will be generated automatially!")))
#+end_src

* Startup Optimization
#+begin_src emacs-lisp 
  (defvar emacs-startup-time 
    (format "%.2f seconds"
            (float-time
             (time-subtract after-init-time before-init-time))) "Emacs start up time")
  (defvar emacs-startup-gc
    gcs-done "Number of garbage collections done at statup")
  (defun my/display-startup-time ()
    (message "Emacs loaded in %s."
             emacs-startup-time
             ))
  
  (add-hook 'emacs-startup-hook #'my/display-startup-time)
#+end_src

Gives a memeory boost at startup
#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 50 1000 1000))
  (defvar my/post-config nil "Weither or not my/post-config has run")
#+end_src

** Debugging
:PROPERTIES:
:header-args: :tangle no
:END:
#+begin_src emacs-lisp
  (setq use-package-verbose t)
#+end_src

* Variables
#+begin_src emacs-lisp
  (defvar my/org-font "Cantarell" "org-mode's variable pitched font name")
  (defvar my/user-font "Fira Code" "emacs's fixed width font")
  (defvar my/font-size 150 "font size for emacs")
  (defvar my/emacs-file (expand-file-name  ".dotfiles/Emacs.org" (getenv "HOME")) "emacs configuration file name")
  (defvar my/guix-file (expand-file-name  ".dotfiles/System.org" (getenv "HOME")) "GNU Guix configuration file")
  (defvar my/alpha-value '(90 . 90) "EXWM default alpha value")
#+end_src

* Initial Buffer
:PROPERTIES:
:header-args: :tangle no
:END:

#+begin_src emacs-lisp 
  (setq initial-buffer-choice (lambda () (switch-to-buffer "*Messages*")))
#+end_src

* Basic UI Improvements

#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
  
  ;; Redirect custom output
  
  (setq custom-file (expand-file-name "emacs-custom.el" user-emacs-directory))
  
  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room
  
  (menu-bar-mode -1)          ; Disable the menu bar
  
  ;; sets fixed-width font
  (set-face-attribute 'default nil :font my/user-font :height my/font-size :weight 'regular)
  
  
  ;; Disables the visual bell
  (setq visible-bell t)
  (column-number-mode)
  (global-display-line-numbers-mode t)
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  markdown-mode
                  eshell-mode-hook
                  dired-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

* Straight and Use-Package
=Straight= and =use-package= setup. 

#+Begin_src emacs-lisp
  ;;(require 'package)
  
  ;;(setq package-archives '(("melpa" . "https://melpa.org/packages/")
  ;;("elpa" . "https://elpa.gnu.org/packages/")))
  
  (add-to-list 'load-path "~/.config/emacs/my-packages")
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
  
  (require 'use-package) 
#+end_src

** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-use-package"
#+end_src

* Keyboard
** Evil

#+begin_src emacs-lisp
  (use-package evil
    :demand t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    :config
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-visual-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-replace-state-map (kbd "C-g") 'evil-normal-state)
    (evil-mode)
    :bind
    ([remap evil-search-forward] . swiper)
    ([remap evil-search-backward] . swiper-backward))
#+end_src

**** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-evil"
#+end_src

*** Evil Collection

#+begin_src emacs-lisp
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init)) 
#+end_src

**** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-evil-collection"
#+end_src

** General

#+begin_src emacs-lisp
  (use-package general
    :after evil
    :config
    (general-evil-setup t))
  
  (general-create-definer my/leader-def
    :keymaps '(normal insert visual emacs)
    :prefix "C-SPC"
    :global-prefix "C-SPC"
    :prefix-command 'my-leader-command
    :prefix-map 'my-leader-map)
  
  (my/leader-def
    "f"     '(nil                                                     :wk "file system")
    "f f"   '(find-file                                               :wk "save-file")
    "f s"   '(save-buffer                                             :wk "save file")
    "f r"   '((lambda () (interactive) (find-file "/sudo::"))         :wk "open file as root")
    "h"     '(nil                                                     :wk "config options")
    "h f"   '((lambda () (interactive)
                (find-file my/emacs-file))                            :wk "open emacs configuration")
    "h M-f" '((lambda () (interactive)
                (find-file my/guix-file))                             :wk "open guix file")
    "a"     '(eshell                                                  :wk "eshell")
    ";"     '(execute-extended-command                                :wk "M-x")
    "w f"   '(delete-frame                                            :wk "delete fram")
    "b"     '(consult-buffer                                          :wk "switch buffers with preview")
    ;;"M-b"   '(ivy-switch-buffer                                       :wk "switch buffer")
    "C-s"   '((lambda () (interactive) (guix))                        :wk "Guix")
    "o"     '(nil                                                     :wk "org")
    "o f"   '(my/org-open-file                                        :wk "open org file")
    "o a"   '(org-agenda                                              :wk "org agenda")
    "c"     '(org-capture                                             :wk "change directory"))
#+end_src

*** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-general"
#+end_src

* Org Mode
** Org Variables

#+begin_src emacs-lisp
  (customize-set-variable 'org-directory "~/Documents/org/")
  (setq org-default-notes-file (expand-file-name "Tasks.org" org-directory))
  (setq org-agenda-files '("Tasks.org" "Appointments.org"))
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (with-eval-after-load 'org
  
  (customize-set-variable 'org-structure-template-alist (cons '("$" . "src emacs-lisp") org-structure-template-alist))
  (customize-set-variable 'org-archive-location ".archive::")
  (customize-set-variable 'org-babel-load-languages '((emacs-lisp . t) (scheme . t))))
  ;; (setq org-refile-targets
  ;;       '((("Appointments.org" :maxlevel . 1))))
  
  ;; ;; Save Org buffers after refilling!
  ;; (advice-add 'org-refile :after 'org-save-all-org-buffers)
#+end_src

