config/.config/emacs/init.el
;; NOTE: init.el is now generated from Emacs.org.  Please edit that file
;;       in Emacs and init.el will be generated automatically!

(defvar emacs-startup-time 
  (format "%.2f seconds"
          (float-time
           (time-subtract after-init-time before-init-time))) "Emacs start up time")
(defvar emacs-startup-gc
  gcs-done "Number of garbage collections done at statup")
(defun my/display-startup-time ()
  (message "Emacs loaded in %s."
           emacs-startup-time
           ))

(add-hook 'emacs-startup-hook #'my/display-startup-time)

(setq gc-cons-threshold (* 50 1000 1000))

(defvar my/org-font "Cantarell" "org-mode's variable pitched font name")
(defvar my/user-font "Fira Code" "emacs's fixed width font")
(defvar my/font-size 150 "font size for emacs")
(defvar my/emacs-file (expand-file-name  ".dotfiles/Emacs.org" (getenv "HOME")) "emacs configuration file name")
(defvar my/guix-file (expand-file-name  ".dotfiles/System.org" (getenv "HOME")) "GNU Guix configuration file")
(defvar my/alpha-value '(90 . 90) "EXWM default alpha value")

(setq inhibit-startup-message t)

;; Redirect custom output

(setq custom-file (expand-file-name "emacs-custom.el" user-emacs-directory))

(scroll-bar-mode -1)        ; Disable visible scrollbar
(tool-bar-mode -1)          ; Disable the toolbar
(tooltip-mode -1)           ; Disable tooltips
(set-fringe-mode 10)        ; Give some breathing room

(menu-bar-mode -1)          ; Disable the menu bar

;; sets fixed-width font
(set-face-attribute 'default nil :font my/user-font :height my/font-size)


;; Disables the visual bell
(setq visible-bell t)
(column-number-mode)
(global-display-line-numbers-mode t)
(dolist (mode '(org-mode-hook
                term-mode-hook
                markdown-mode
                eshell-mode-hook
                dired-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

;;(require 'package)

;;(setq package-archives '(("melpa" . "https://melpa.org/packages/")
;;("elpa" . "https://elpa.gnu.org/packages/")))

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(require 'use-package)

(use-package evil
  :demand t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  :config
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-visual-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-replace-state-map (kbd "C-g") 'evil-normal-state)
  (evil-mode)
  :bind
  ([remap evil-search-forward] . swiper)
  ([remap evil-search-backward] . swiper-backward))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))

(use-package general
  :after evil
  :config
  (general-evil-setup t))

(general-create-definer my/leader-def
  :keymaps '(normal insert visual emacs)
  :prefix "C-SPC"
  :global-prefix "C-SPC"
  :prefix-command 'my-leader-command
  :prefix-map 'my-leader-map)

(my/leader-def
  "f"     '(nil                                                     :wk "file system")
  "f f"   '(find-file                                               :wk "save-file")
  "f s"   '(save-buffer                                             :wk "save file")
  "f r"   '((lambda () (interactive) (find-file "/sudo::"))         :wk "open file as root")
  "h"     '(nil                                                     :wk "config options")
  "h f"   '((lambda () (interactive)
              (find-file my/emacs-file))                            :wk "open emacs configuration")
  "h M-f" '((lambda () (interactive)
              (find-file my/guix-file))                             :wk "open guix file")
  "a"     '(eshell                                                  :wk "eshell")
  ";"     '(execute-extended-command                                :wk "M-x")
  "w f"   '(delete-frame                                            :wk "delete fram")
  "b"     '(consult-buffer                                          :wk "switch buffers with preview")
  ;;"M-b"   '(ivy-switch-buffer                                       :wk "switch buffer")
  "C-s"   '((lambda () (interactive) (guix))                        :wk "Guix")
  "o"     '(nil                                                     :wk "org")
  "o f"   '(my/org-open-file                                        :wk "open org file")
  "o a"   '(org-agenda                                              :wk "org agenda")
  "c"     '(org-capture                                             :wk "change directory"))

(use-package swiper)

(customize-set-variable 'org-directory "~/Documents/org/")
(customize-set-variable 'org-archive-location "~/Documents/org/archive.org")
(setq org-default-notes-file (expand-file-name "Tasks.org" org-directory))
(setq org-agenda-files '("Tasks.org"))
(setq org-log-done 'time)
(setq org-log-into-drawer t)
(setq org-refile-targets
      '(("Archive.org" :maxlevel . 1)
        (".archive.org" :maxlevel . 1)))

;; Save Org buffers after refilling!
(advice-add 'org-refile :after 'org-save-all-org-buffers)
