config/.config/emacs/init.el

(setq org-todo-keywords
      '((sequence "TODO(t)" "STARTED(s)" "|" "DONE(d)")
        (sequence "HOLD(h)" "|" "COMPLETED(c)" "DROED(D@)")
        (sequence "NOT_BOOKED" "|" "BOOKED")))

(setq org-capture-templates
      '(("t" "TODO")
        ("tg" "General" entry (file+olp "~/Documents/org/Tasks.org" "General")
         "* TODO %^{Title}\n %?")
        ("th" "House" entry (file+olp "~/Documents/org/Tasks.org" "Household")
         "* TODO %?\n")
        ("tm" "Medical" entry (file+olp "~/Documents/org/Tasks.org" "Medical")
         "* %^{Status|MEDICAL|NOT_BOOKED|BOOKED} %?\nDoctor: %^{Doctor|Mc'G|Lewis|Shell}\nDate: ")

        ("c" "Configs")
        ("ce" "Emacs")
        ("ceo" "Org" entry (file+olp "~/.dotfiles/Emacs.org" "Inbox" "Org")
         "* TODO %^{Title}\nDescription: %?")
        ("cee" "Emacs" entry (file+olp "~/.dotfiles/Emacs.org" "Inbox" "General")
         "* %^{Title}\n%?")

        ("cd" "Desktop")
        ("cdk" "Keybindings" entry (file+olp "~/.dotfiles/Desktop.org" "Inbox" "Keybindings")
         "* TODO %^{Function: }\nBinding: =%^{Binding}=\nMap: %^{Keymap: }")
        ("cdw" "Windows" entry (file+olp "~/.dotfiles/Desktop.org" "Inbox" "Windows")
         "* TODO %^{Window}\nDesired Behaviour:%?")
        ("cdg" "General" entry (file+olp "~/.dotfiles/Desktop.org" "Inbox" "General")
         "* TODO %?")

        ("cs" "System")
        ("cso" "Os" entry (file+olp "~/.dotfiles/System.org" "Inbox" "Os")
         "* TODO %^{Title}\n%?")
        ("csm" "Manifests" entry (file+olp "~/.dotfiles/System.org" "Inbox" "Manifests" "Inbox")
         "* %^{Package name: }\nManifest: %^{Manifest: }")
        ("csg" "General" entry (file+olp "~/.dotfiles/System.org" "Inbox" "General")
         "* TODO %?")))

(defun my/org-open-file (a)  "Opens the file in `org-directory'"
       (interactive "sOrg File: ")
       (find-file (expand-file-name (concat a ".org") org-directory)))

(use-package org
  :straight t
  :no-require t
  :bind ((:map org-mode-map
               ("C-c o" . consult-outline)))
  ([remap evil-jump-forward] . org-cycle)
  :hook (org-mode . my/org-mode-setup)
  (org-mode . (lambda () (add-hook 'after-save-hook #'my/org-babel-tangle-config)))
  :config
  (defun my/org-font-setup ()
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font my/org-font :weight 'regular :height (cdr face)))
  
    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
  (defun my/org-mode-setup ()
    (org-indent-mode)
    (visual-line-mode 1))
  (setq org-ellipsis " ▾")
  (setq org-hide-emphasis-markers t)
  (setq org-confirm-babel-evaluate nil)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)))
  (defun my/org-babel-tangle-config ()
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name "~/.dotfiles/"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))
  (my/org-font-setup))

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(use-package visual-fill-column
  :after org
  :config
  (defun my/org-mode-visual-fill () 
    (setq visual-fill-column-width 115
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))
  :hook (org-mode . my/org-mode-visual-fill)
  (markdown-mode . my/org-mode-visual-fill))

(use-package emacsql
  :straight t)
(use-package emacsql-sqlite
  :straight t)
(use-package org-roam
  :straight t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory (expand-file-name "roam" org-directory))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i" . completion-at-point)
         :map org-roam-dailies-map
         ("Y" . org-roam-dailies-capture-yesterday)
         ("T" . org-roam-dailies-capture-tomorrow))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
  ("C-c n d" . org-roam-dailies-map)
  :config
  (require 'org-roam-dailies)
  (org-roam-db-autosync-mode))

(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))

(use-package dired
  :after evil
  :demand t
  :commands (dired dired-jump)
  :hook (dired-mode . dired-hide-details-mode)
  :bind (("C-x C-j" . dired-jump))
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-up-directory
    "l" 'dired-find-file)
  (setq dired-always-read-filesystem t
        dired-switches-in-mode-line t)
  :custom ((dired-listing-switches "-aBGgD --group-directories-first")))

(use-package dired-single
  :straight t)

(evil-collection-define-key 'normal 'dired-mode-map
  "h" 'dired-single-up-directory
  "l" 'dired-single-buffer)

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

;; (use-package dired-hide-dotfiles
;;   :straight t
;;   :hook (dired-mode . dired-hide-dotfiles-mode)
;;   :config
;;   (evil-collection-define-key 'normal 'dired-mode-map
;;     "H" 'dired-hide-dotfiles-mode))
