Emacs.org
** Vertico

#+begin_src emacs-lisp
  (defun my/minibuffer-backward-kill (arg)
    "When minibuffer is completing a file name delete up to parent
    folder, otherwise delete a character backward"
    (interactive "p")
    (if minibuffer-completing-file-name
        ;; Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
        (if (string-match-p "/." (minibuffer-contents))
            (zap-up-to-char (- arg) ?/)
          (delete-minibuffer-contents))
      (delete-backward-char arg)))
  
  (use-package vertico
    :init
    (vertico-mode)
    (setq vertico-cycle t)
    (setq vertico-resize t)
    :bind
    (:map vertico-map
          ("C-j" . vertico-next)
          ("C-k" . vertico-previous))
    (:map minibuffer-local-map
          ("<backspace>" . my/minibuffer-backward-kill)))
  
  (use-package orderless
    :init
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion)))
          selectrum-highlight-candidates-function #'orderless-highlight-matches))
  
  ;; Persist history over Emacs restarts. Vertico sorts by history position. 
  (use-package savehist
    :init
    (savehist-mode))
#+end_src

*** Guix
:PROPERTIES:
:header-args: :noweb-ref packages :tangle no
:END:
#+begin_src scheme
  "emacs-vertico"
  "emacs-orderless"
#+end_src

** Selectrum

#+begin_src emacs-lisp
  (use-package selectrum)
#+end_src

*** GUIX
:PROPERTIES:
:header-args: :noweb-ref packages :tangle no
:END:
#+begin_src scheme
  "emacs-selectrum"
#+end_src

** Consult

#+begin_src emacs-lisp
  (use-package consult
    :bind
    ("C-s" . consult-line))
#+end_src

*** Guix
:PROPERTIES:
:header-args: :noweb-ref packages :tangle no
:END:
#+begin_src emacs-lisp
  "emacs-consult"
#+end_src

** Dotcrafter

#+begin_src emacs-lisp
  (use-package dotcrafter
    :straight '(dotcrafter :host github :repo "delta1024/dotcrafter.el")
    :config
    (dotcrafter-mode)
    :custom
    (dotcrafter-config-files-directory "config")
    (dotcrafter-ensure-output-directories
     '(".gnupg" ".local/share" ".config/emacs"))
    (dotcrafter-org-files
     '("Emacs.org" "System.org" "Desktop.org" "Shells.org")))
#+end_src

** Embark

#+begin_src emacs-lisp
  
  (use-package embark
  
    :bind
    (("M-o" . embark-act))         ;; pick some comfortable binding
  
    :config
  
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))
#+end_src

*** GUIX
:PROPERTIES:
:header-args: :noweb-ref packages :tangle no
:END:
#+begin_src scheme
  "emacs-embark"
#+end_src

** Marginalia

#+begin_src emacs-lisp
  
  (use-package marginalia
    ;; Either bind `marginalia-cycle` globally or only in the minibuffer
    :bind (:map minibuffer-local-map
                ("M-A" . marginalia-cycle))
  
    ;; The :init configuration is always executed (Not lazy!)
    :init
  
    ;; Must be in the :init section of use-package such that the mode gets
    ;; enabled right away. Note that this forces loading the package.
    (marginalia-mode))
#+end_src

*** GUIX
:PROPERTIES:
:header-args: :noweb-ref packages :tangle no
:END:
#+begin_src scheme
  "emacs-marginalia"
#+end_src

** app-launcher

#+begin_src emacs-lisp
  (use-package app-launcher
    :straight '(app-launcher :host github :repo "SebastienWae/app-launcher")
    :config
    (dolist (profiles '("browsers/browsers/share/applications"
                        "apps/apps/share/applications"
                        "desktop/desktop/share/applications"
                        "emacs/emacs/share/applications"))
      (add-to-list 'app-launcher-apps-directories (concat (getenv "GUIX_EXTRA_PROFILES") "/" profiles)))
    (add-to-list 'app-launcher-apps-directories "/var/lib/flatpak/exports/share/applications"))
#+end_src

** DEAD Ivy 
CLOSED: [2021-08-28 Sat 16:49]
:LOGBOOK:
- State "DEAD"       from              [2021-08-28 Sat 16:49] \\
  Droped in favor of =vertico=
:END:

#+begin_src emacs-lisp :tangle no
  (use-package ivy
    :disabled t
    :diminish t
    :bind (:map ivy-minibuffer-map
                ("TAB" . ivy-alt-done)	
                ("C-l" . ivy-alt-done)
                ("C-j" . ivy-next-line)
                ("C-k" . ivy-previous-line)
                :map ivy-switch-buffer-map
                ("C-k" . ivy-previous-line)
                ("C-j" . ivy-next-line)
                ("C-l" . ivy-done)
                ("C-d" . ivy-switch-buffer-kill)
                :map ivy-reverse-i-search-map
                ("C-k" . ivy-previous-line)
                ("C-j" . ivy-next-line)
                ("C-d" . ivy-reverse-i-search-kill)))
  
#+end_src

*** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-ivy"
#+end_src

** DEAD Counsel
CLOSED: [2021-08-28 Sat 16:50]
:LOGBOOK:
- State "DEAD"       from              [2021-08-28 Sat 16:50] \\
  Droped in favor of =consult=
:END:
#+begin_src emacs-lisp :tangle no
  (use-package counsel
    :disabled t
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-switch-buffer-other-window))
    :custom
    ((counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)))
  
#+end_src

*** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-counsel"
#+end_src

** DEAD Ivy Rich
CLOSED: [2021-08-28 Sat 16:51]
:LOGBOOK:
- State "DEAD"       from              [2021-08-28 Sat 16:51] \\
  droped in favor of =marginalia=
:END:

#+begin_src emacs-lisp :tangle no
  
  (use-package ivy-rich
    :disabled
    :after ivy)
  
#+end_src

*** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-ivy-rich"
#+end_src

** Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    ;;:custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map))
  ;; NOTE: Set this to the folder where you keep your Git repos!
#+end_src

**** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-projectile"
#+end_src

*** Counsel-Projectile
#+begin_src emacs-lisp
  (use-package counsel-projectile
    :disabled t
    :after projectile
    :config (counsel-projectile-mode))
#+end_src

**** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-counsel-projectile"
#+end_src

** Magit

#+begin_src emacs-lisp
  (use-package magit
    :config (evil-collection-magit-setup)
    :general
    (:prefix-map 'my-leader-map
                 "g" '(magit :which-key "Status")))
#+end_src

**** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-magit"
#+end_src

** Pass

#+begin_src emacs-lisp
  (use-package pass)
  (use-package pinentry
    :config
    (pinentry-start))
#+end_src

*** Guix

#+begin_src scheme :noweb-ref packages :tangle no
  "emacs-pass"
  "emacs-pinentry"
#+end_src

** Helpful

#+begin_src emacs-lisp
  (use-package helpful
    :bind
    ([remap describe-function] . helpful-callable)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-key] . helpful-key))
#+end_src

*** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-helpful"
#+end_src

** Doom
*** Doom Themes

#+begin_src emacs-lisp
  (use-package doom-themes
    :init
    (load-theme 'doom-one t))
#+end_src

**** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-doom-themes"
#+end_src

*** Doom Modeline 

NOTE: The first time you load your configuration on a new machine, you'll
need to run the following command interactively so that mode line icons
display correctly:

=M-x all-the-icons-install-fonts=

#+begin_src emacs-lisp
  (use-package all-the-icons)
  
  (use-package doom-modeline
    :init (doom-modeline-mode t)
    :custom ((doom-mode-line-height 13)))
#+end_src

**** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-all-the-icons"
  "emacs-doom-modeline"
#+end_src

** Rainbow Delimiters

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-rainbow-delimiters"
#+end_src

** Cusotm Helper Functions
#+begin_src emacs-lisp
#+end_src

** Which-Key

#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))
#+end_src

*** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-which-key"
#+end_src

** Swiper
#+begin_src emacs-lisp
  (use-package swiper)
#+end_src

*** Guix
:PROPERTIES:
:header-args: :noweb-ref packages
:END:
#+begin_src scheme
  "emacs-swiper"
#+end_src

* exwm
load in exwm
#+begin_src emacs-lisp
  (defun my/exwm-load (switch)
    (load-file (expand-file-name "desktop.el" user-emacs-directory )))
  (add-to-list 'command-switch-alist '("-exwm" . my/exwm-load))
#+end_src

** Guix
#+begin_src scheme :noweb-ref packages :tangle no
  "emacs-exwm"
  "emacs-desktop-environment"
#+end_src

* Runtime Optimization

Returns the garbage collector to a sane value.
#+begin_src emacs-lisp
  (defun my/post-config () "Sets the `gc-cons-threshold' to a sane value and loads the custom file, among other things"
         (require 'org)
         (setq gc-cons-threshold (* 2 1000 1000))
         ;; We're going to load custom here becaus it makes more
         ;; sense to do so here with how EXWM is loaded
         (load custom-file :noerror)
         (setq my/post-config t))
  
  ;; Returns nil if switch is abset
  (defun found-custom-arg (switch) "Returns nil if switch is absent"
         (let ((found-switch (member switch command-line-args)))
           found-switch))
  
  ;; if exwm isn't running set custom variables
  (unless (found-custom-arg "-exwm")
    (my/post-config))
#+end_src

* Manifest
Guix Manifest
#+NAME: manifest-header
#+begin_src emacs-lisp :tangle no
  (my/--generate-file-header "Emacs.org" "emacs.scm")
#+end_src
config/.config/guix/manifests/emacs.scm
#+begin_src scheme :noweb yes :tangle config/.config/guix/manifests/emacs.scm 
  <<manifest-header()>>
  (specifications->manifest
   (list "emacs-native-comp"
         "emacs-guix"
         <<packages>>))
#+end_src
