config/.config/emacs/init.el

(use-package vertico
  :init
  (vertico-mode)
  (setq vertico-cycle t)
  (setq vertico-resize t)
  :bind
  (:map vertico-map
        ("C-j" . vertico-next)
        ("C-k" . vertico-previous)))

(use-package orderless
  :init
  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))
        selectrum-highlight-candidates-function #'orderless-highlight-matches))

;; Persist history over Emacs restarts. Vertico sorts by history position. 
(use-package savehist
  :init
  (savehist-mode))

(use-package selectrum)

(use-package consult
  :bind
  ("C-s" . consult-line))

(use-package embark

  :bind
  (("M-o" . embark-act))         ;; pick some comfortable binding

  :config

  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

(use-package marginalia
  ;; Either bind `marginalia-cycle` globally or only in the minibuffer
  :bind (:map minibuffer-local-map
              ("M-A" . marginalia-cycle))

  ;; The :init configuration is always executed (Not lazy!)
  :init

  ;; Must be in the :init section of use-package such that the mode gets
  ;; enabled right away. Note that this forces loading the package.
  (marginalia-mode))

(use-package app-launcher
  :straight '(app-launcher :host github :repo "SebastienWae/app-launcher")
  :config
  (dolist (profiles '("browsers/browsers/share/applications"
                      "apps/apps/share/applications"
                      "desktop/desktop/share/applications"
                      "emacs/emacs/share/applications"))
    (add-to-list 'app-launcher-apps-directories (concat (getenv "GUIX_EXTRA_PROFILES") "/" profiles))))

(use-package ivy
  :disabled t
  :diminish t
  :bind (:map ivy-minibuffer-map
              ("TAB" . ivy-alt-done)	
              ("C-l" . ivy-alt-done)
              ("C-j" . ivy-next-line)
              ("C-k" . ivy-previous-line)
              :map ivy-switch-buffer-map
              ("C-k" . ivy-previous-line)
              ("C-j" . ivy-next-line)
              ("C-l" . ivy-done)
              ("C-d" . ivy-switch-buffer-kill)
              :map ivy-reverse-i-search-map
              ("C-k" . ivy-previous-line)
              ("C-j" . ivy-next-line)
              ("C-d" . ivy-reverse-i-search-kill)))

(use-package counsel
  :disabled t
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-switch-buffer-other-window))
  :custom
  ((counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)))

(use-package ivy-rich
  :disabled
  :after ivy)

(use-package projectile
  :diminish projectile-mode
  ;;:custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map))
;; NOTE: Set this to the folder where you keep your Git repos!

(use-package counsel-projectile
  :disabled t
  :after projectile
  :config (counsel-projectile-mode))

(use-package magit
  :config (evil-collection-magit-setup)
  :general
  (:prefix-map 'my-leader-map
               "g" '(magit :which-key "Status")))

(use-package pass)
(use-package pinentry
  :config
  (pinentry-start))

(use-package helpful
  :bind
  ([remap describe-function] . helpful-callable)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key] . helpful-key))

(use-package doom-themes
  :init
  (load-theme 'doom-one t))

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode t)
  :custom ((doom-mode-line-height 13)))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(defun my/exwm-load (switch)
  (load-file (expand-file-name "desktop.el" user-emacs-directory )))
;;  (load-file (expand-file-name "desktop.el" user-emacs-directory))
(add-to-list 'command-switch-alist '("-exwm" . my/exwm-load))

(defun my/post-config () "Sets the `gc-cons-threshold' to a sane value and loads the custom file"
       (setq gc-cons-threshold (* 2 1000 1000))
       ;; We're going to load custom here becaus it makes more
       ;; sense to do so here with how EXWM is loaded
       (load custom-file :noerror))

;; Returns nil if switch is abset
(defun found-custom-arg (switch) "Returns nil if switch is absent"
       (let ((found-switch (member switch command-line-args)))
         found-switch))

;; if exwm isn't running set custom variables
(unless (found-custom-arg "-exwm")
  (my/post-config))
